Autodesk.Revit.DB.Structure.ReinforcementSettings.RebarVaryingLengthNumberSuffix
A unique identifier used for a bar within a variable length rebar set.
Remarks:
This property is used by the numbering method only when varying rebars are numbered as a whole.
Throws Autodesk.Revit.Exceptions.ArgumentException:
When setting this property: The rebar number suffix is not valid if :
Input is empty.Input contains non-alphanumeric characters.Input contains both numeric and alphabetic characters.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
When setting this property: A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017

Autodesk.Revit.DB.Structure.ReinforcementSettings.NumberVaryingLengthRebarsIndividually
Use this option to modify the way varying length bars are numbered (individually or as a whole).
Remarks:
If the property is :
True, then each bar in a varying rebar set will be assigned a rebar number.False, the whole rebar set will be assigned a unique rebar number and each bar within the set will be assigend a suffix (unique within the set).
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.
Since:
2017